PX4/PX4-Autopilot/nuttx/arch/arm/src/sam3u/sam3u_smc.h
/* SMC NFC Control Register */

#define SMC_CTRL_NFCEN               (1 << 0)  /* Bit 0:  NAND Flash Controller Enable */
#define SMC_CTRL_NFCDIS              (1 << 1)  /* Bit 1:  NAND Flash Controller Disable */

/* SMC NFC Status Register, SMC NFC Interrupt Enable Register, SMC NFC Interrupt
 * Disable Register, and SMC NFC Interrupt Mask Register common bit-field definitions 
 */

#define SMC_SR_SMCSTS                (1 << 0)  /* Bit 0:  NAND Flash Controller status (SR only) */
#define SMC_INT_RBRISE               (1 << 4)  /* Bit 4:  Ready Busy Rising Edge Detection Interrupt */
#define SMC_INT_RBFALL               (1 << 5)  /* Bit 5:  Ready Busy Falling Edge Detection Interrupt */
#define SMC_SR_NFCBUSY               (1 << 8)  /* Bit 8:  NFC Busy (SR only) */
#define SMC_SR_NFCWR                 (1 << 11) /* Bit 11: NFC Write/Read Operation (SR only) */
#define SMC_SR_NFCSID                (1 << 12) /* Bit 13: NFC Chip Select ID (SR only) */
#define SMC_INT_XFRDONE              (1 << 16) /* Bit 16: Transfer Done Interrupt */
#define SMC_INT_CMDDONE              (1 << 17) /* Bit 17: Command Done Interrupt */
#define SMC_INT_DTOE                 (1 << 20) /* Bit 20: Data Timeout Error Interrupt */
#define SMC_INT_UNDEF                (1 << 21) /* Bit 21: Undefined Area Access Interrupt */
#define SMC_INT_AWB                  (1 << 22) /* Bit 22: Accessing While Busy Interrupt */
#define SMC_INT_NFCASE               (1 << 23) /* Bit 23: NFC Access Size Error Interrupt */
#define SMC_INT_RBEDGE(n)            (1<<((n)+24))
#define SMC_INT_RB_EDGE0             (1 << 24) /* Bit 24: Ready/Busy Line 0 Interrupt */
#define SMC_INT_RB_EDGE1             (1 << 25) /* Bit 25: Ready/Busy Line 1 Interrupt */
#define SMC_INT_RB_EDGE2             (1 << 26) /* Bit 26: Ready/Busy Line 2 Interrupt */
#define SMC_INT_RB_EDGE3             (1 << 27) /* Bit 27: Ready/Busy Line 3 Interrupt */
#define SMC_INT_RB_EDGE4             (1 << 28) /* Bit 28: Ready/Busy Line 4 Interrupt */
#define SMC_INT_RB_EDGE5             (1 << 29) /* Bit 29: Ready/Busy Line 5 Interrupt */
#define SMC_INT_RB_EDGE6             (1 << 30) /* Bit 30: Ready/Busy Line 6 Interrupt */
#define SMC_INT_RB_EDGE7             (1 << 31) /* Bit 31: Ready/Busy Line 7 Interrupt */

/* SMC NFC Address Cycle Zero Register */

#define SMC_ADDR_ADDR_CYCLE0_SHIFT   (3)       /* Bits 0-7: NAND Flash Array Address cycle 0 */
#define SMC_ADDR_ADDR_CYCLE0_SHIFT   (3)       /* Bits 0-7: NAND Flash Array Address cycle 0 */

/* SMC NFC Bank Register */

#define SMC_BANK_SHIFT               (0)       /* Bits 0-2: Bank identifier */
#define SMC_BANK_MASK                (7 << SMC_BANK_SHIFT)

/* SMC ECC Control Register */

#define SMC_ECCCTRL_RST              (1 << 0)  /* Bit 0:  Reset ECC */
#define SMC_ECCCTRL_SWRST            (1 << 1)  /* Bit 1:  Software Reset */

/* SMC ECC MODE Register */

#define SMC_ECCMD_ECC_PAGESIZE_SHIFT   (0)       /* Bits 0-1 */
#define SMC_ECCMD_ECC_PAGESIZE_MASK    (3 << SMC_ECCMD_ECC_PAGESIZE_SHIFT)
#  define SMC_ECCMD_ECC_PAGESIZE_528   (0 << SMC_ECCMD_ECC_PAGESIZE_SHIFT)
#  define SMC_ECCMD_ECC_PAGESIZE_1056  (1 << SMC_ECCMD_ECC_PAGESIZE_SHIFT)
#  define SMC_ECCMD_ECC_PAGESIZE_2112  (2 << SMC_ECCMD_ECC_PAGESIZE_SHIFT)
#  define SMC_ECCMD_ECC_PAGESIZE_4224  (3 << SMC_ECCMD_ECC_PAGESIZE_SHIFT)
#define SMC_ECCMD_TYPCORREC_SHIFT      (4)      /* Bits 4-5: type of correction */
#define SMC_ECCMD_TYPCORREC_MASK       (3 << SMC_ECCMD_TYPCORREC_SHIFT)
#  define SMC_ECCMD_TYPCORREC_PAGE     (0 << SMC_ECCMD_TYPCORREC_SHIFT) /* 1 bit correction for a page */
#  define SMC_ECCMD_TYPCORREC_256      (1 << SMC_ECCMD_TYPCORREC_SHIFT) /* 1 bit correction for 256 bytes */
#  define SMC_ECCMD_TYPCORREC_512      (2 << SMC_ECCMD_TYPCORREC_SHIFT) /* 1 bit correction for 512 bytes */

/* SMC ECC Status Register 1 */

#define _RECERR                      (0) /* Recoverable Error */
#define _ECCERR                      (1) /* ECC Error */
#define _MULERR                      (2) /* Multiple Error */

#define SMC_ECCSR1_RECERR(n)         (1 << (((n)<<4)+_RECERR))
#define SMC_ECCSR1_ECCERR(n)         (1 << (((n)<<4)+_ECCERR))
#define SMC_ECCSR1_MULERR(n)         (1 << (((n)<<4)+_MULERR))

#define SMC_ECCSR1_RECERR0           SMC_ECCSR1_RECERR(0)
#define SMC_ECCSR1_ECCERR0           SMC_ECCSR1_ECCERR(0)
#define SMC_ECCSR1_MULERR0           SMC_ECCSR1_MULERR(0)
#define SMC_ECCSR1_RECERR1           SMC_ECCSR1_RECERR(1)
#define SMC_ECCSR1_ECCERR1           SMC_ECCSR1_ECCERR(1)
#define SMC_ECCSR1_MULERR1           SMC_ECCSR1_MULERR(1)
#define SMC_ECCSR1_RECERR2           SMC_ECCSR1_RECERR(2)
#define SMC_ECCSR1_ECCERR2           SMC_ECCSR1_ECCERR(2)
#define SMC_ECCSR1_MULERR2           SMC_ECCSR1_MULERR(2)
#define SMC_ECCSR1_RECERR3           SMC_ECCSR1_RECERR(3)
#define SMC_ECCSR1_ECCERR3           SMC_ECCSR1_ECCERR(3)
#define SMC_ECCSR1_MULERR3           SMC_ECCSR1_MULERR(3)
#define SMC_ECCSR1_RECERR4           SMC_ECCSR1_RECERR(4)
#define SMC_ECCSR1_ECCERR4           SMC_ECCSR1_ECCERR(4)
#define SMC_ECCSR1_MULERR4           SMC_ECCSR1_MULERR(4)
#define SMC_ECCSR1_RECERR5           SMC_ECCSR1_RECERR(5)
#define SMC_ECCSR1_ECCERR5           SMC_ECCSR1_ECCERR(5)
#define SMC_ECCSR1_MULERR5           SMC_ECCSR1_MULERR(5)
#define SMC_ECCSR1_RECERR6           SMC_ECCSR1_RECERR(6)
#define SMC_ECCSR1_ECCERR6           SMC_ECCSR1_ECCERR(6)
#define SMC_ECCSR1_MULERR6           SMC_ECCSR1_MULERR(6)
#define SMC_ECCSR1_RECERR7           SMC_ECCSR1_RECERR(7)
#define SMC_ECCSR1_ECCERR7           SMC_ECCSR1_ECCERR(7)
#define SMC_ECCSR1_MULERR7           SMC_ECCSR1_MULERR(7)

/* SMC ECC Status Register 2 */

#define SMC_ECCSR2_RECERR(n)         (1 << ((((n)-8)<<4)+_RECERR))
#define SMC_ECCSR2_ECCERR(n)         (1 << ((((n)-8)<<4)+_ECCERR))
#define SMC_ECCSR2_MULERR(n)         (1 << ((((n)-8)<<4)+_MULERR))

#define SMC_ECCSR2_RECERR8           SMC_ECCSR2_RECERR(8)
#define SMC_ECCSR2_ECCERR8           SMC_ECCSR2_ECCERR(8)
#define SMC_ECCSR2_MULERR8           SMC_ECCSR2_MULERR(8)
#define SMC_ECCSR2_RECERR9           SMC_ECCSR2_RECERR(9)
#define SMC_ECCSR2_ECCERR9           SMC_ECCSR2_ECCERR(9)
#define SMC_ECCSR2_MULERR9           SMC_ECCSR2_MULERR(9)
#define SMC_ECCSR2_RECERR10          SMC_ECCSR2_RECERR(10)
#define SMC_ECCSR2_ECCERR10          SMC_ECCSR2_ECCERR(10)
#define SMC_ECCSR2_MULERR10          SMC_ECCSR2_MULERR(10)
#define SMC_ECCSR2_RECERR11          SMC_ECCSR2_RECERR(11)
#define SMC_ECCSR2_ECCERR11          SMC_ECCSR2_ECCERR(11)
#define SMC_ECCSR2_MULERR11          SMC_ECCSR2_MULERR(11)
#define SMC_ECCSR2_RECERR12          SMC_ECCSR2_RECERR(12)
#define SMC_ECCSR2_ECCERR12          SMC_ECCSR2_ECCERR(12)
#define SMC_ECCSR2_MULERR12          SMC_ECCSR2_MULERR(12)
#define SMC_ECCSR2_RECERR13          SMC_ECCSR2_RECERR(13)
#define SMC_ECCSR2_ECCERR13          SMC_ECCSR2_ECCERR(13)
#define SMC_ECCSR2_MULERR13          SMC_ECCSR2_MULERR(13)
#define SMC_ECCSR1_RECERR14          SMC_ECCSR2_RECERR(14)
#define SMC_ECCSR1_ECCERR14          SMC_ECCSR2_ECCERR(14)
#define SMC_ECCSR1_MULERR14          SMC_ECCSR2_MULERR(14)
#define SMC_ECCSR1_RECERR15          SMC_ECCSR2_RECERR(15)
#define SMC_ECCSR1_ECCERR15          SMC_ECCSR2_ECCERR(15)
#define SMC_ECCSR1_MULERR15          SMC_ECCSR2_MULERR(15)

/* Registers for 1 ECC for a page of 512/1024/2048/4096 bytes */
/* SMC_ECC_PR0 */

#define SMC_ECCPR0_BITADDR_SHIFT     (0)       /* Bits 0-3: Bit Address */
#define SMC_ECCPR0_BITADDR_MASK      (15 << SMC_ECCPR0_BITADDR_SHIFT)
#define SMC_ECCPR0_WORDADDR_SHIFT    (4)       /* Bits 4-15: Word Address */
#define SMC_ECCPR0_WORDADDR_MASK     (0xfff << SMC_ECCPR0_WORDADDR_SHIFT)

#define SMC_ECCPR1_NPARITY_SHIFT     (0)       /* Bits 0-15 */
#define SMC_ECCPR1_NPARITY_MASK      (0xffff << SMC_ECCPR1_NPARITY_SHIFT)

/* Registers for 1 ECC per 512 bytes for a page of 512/2048/4096 bytes, 8-bit word */

#define SMC_ECCPR512_BITADDR_SHIFT   (0)       /* Bits 0-3: Bit Address */
#define SMC_ECCPR512_BITADDR_MASK    (15 << SMC_ECCPR512_BITADDR_SHIFT)
#define SMC_ECCPR512_WORDADDR_SHIFT  (4)       /* Bits 4-15: Word Address */
#define SMC_ECCPR512_WORDADDR_MASK   (0xfff << SMC_ECCPR512_WORDADDR_SHIFT)
#define SMC_ECCPR512_NPARITY_SHIFT   (12)      /* Bits 12-23 (or is it 31?) */
#define SMC_ECCPR512_NPARITY_MASK    (0xfff << SMC_ECCPR512_NPARITY_SHIFT)

/* Registers for 1 ECC per 256 bytes for a page of 512/2048/4096 bytes, 8-bit word */

